Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/Microchip.SAMV71_DFP.pdsc
<?xml version='1.0' encoding='ASCII'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Microchip</vendor>
   <url>http://packs.download.atmel.com/</url>
   <name>SAMV71_DFP</name>
   <description>Microchip SAMV71 Series Device Support</description>
   <releases>
      <release version="4.0.23" date="2019-04-04">Removed legacy headers</release>
      <release version="3.0.8" date="2019-02-14">Corrections to XML and header-files. Core modules descriptions in ATDF and SVD changed for rev. B devices. Core IRQ and interrupt handler names changed to alligne with CMSIS names. Old names mapped as aliases to new names. Several errors in SVD files corrected. Missing TC1 and TC2 to instance definitions added to header files. TC, USART and USBHS module changed (for revB devices) to reflect the modes according to the datasheet. Added ARMCC support files. Added Keil support files. Added python programming and debugging scripts for MPLAB X. Succeeds Atmel.SAMV71_DFP 2.3.136.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAMV71</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAMV71" Dvendor="Microchip:3">
         <debugvars configfile="samv71/keil/debug/SAMx7.dbgconf" version="1.0.0">
          // Debug Access Variables
          __var TracePCK3 = 0x00000000;                                               // Trace Clock Source Selection and Prescaler
        </debugvars>
         <sequences>
          <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart">
               <block>
              __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
              __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
            </block>
               <control if="traceSWO">
                  <block>
                Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
              </block>
               </control>
               <control if="traceTPIU">
                  <block>
                Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
              </block>
               </control>
            </sequence>
     
            <!-- User-Defined EnableTraceSWO Sequence -->
            <sequence name="EnableTraceSWO">
               <block>
              Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
              Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
              Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
            </block>
            </sequence>
     
            <!-- User-Defined EnableTraceTPIU Sequence -->
            <sequence name="EnableTraceTPIU">
               <block>
              __var width = (__traceout &amp; 0x003F0000) &gt;&gt; 16;                // TPIU Port Width
              __var val   = 0;
            </block>
               <control if="width == 1">
                  <block>
                // 1-Bit TPIU Trace Setup
                val = 0x00000010;                                                     // TRACED[0]
              </block>
               </control>
               <control if="width == 2">
                  <block>
                // 2-Bit TPIU Trace Setup
                val = 0x00000030;                                                     // TRACED[0..1]
              </block>
               </control>
               <control if="width == 4">
                  <block>
                // 4-Bit TPIU Trace Setup
                val = 0x000000F0;                                                     // TRACED[0..3]
              </block>
               </control>
               <block>
              // Write Trace Configuration to Target
              Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
              Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
              Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
              Write32(0x400E0610, (1 &lt;&lt; 16));                                   // Enable PIOD clock
     
              Write32(0x400E14E4, 0x50494F00);                                        // Disable PIOD write protection
              Write32(0x400E1404, (val | 0x00000100));                                // Disable PIOD PD[4..8]
              Write32(0x400E1470, ((Read32(0x400E1470) &amp; ~val) | 0x00000100));    // Set Peripheral Select registers
              Write32(0x400E1474, ((Read32(0x400E1474) |      val) | 0x00000100));    // TRACED[0..3] to alternate peripheral C and TRACECLK to alternate peripheral D
            </block>
            </sequence>     
        </sequences>
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="ATSAMV71J21">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="samv71/include/sam.h" define="__SAMV71J21__"/>
            <debug svd="samv71/svd/ATSAMV71J21.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00200000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="samv71/keil/flash/ATSAMV7x_2048.FLM" start="0x00400000" size="0x00200000" default="1"/>
            <algorithm name="samv71/keil/flash/ATSAMV7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samv71/atdf/ATSAMV71J21.atdf"/>
                  <at:variant ordercode="ATSAMV71J21A-AAB" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00200000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samv71/edc/ATSAMV71J21.PIC"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM&#174; Cortex&#174;-M7 microcontroller with 2MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, CAN-FD, Full-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins ARM&#174; Cortex&#174;-M7 microcontroller with 2MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, CAN-FD, Full-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMV71J21" title="Device page for ATSAMV71J21"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMV71J21" title="Datasheet"/>
         </device>
         <device Dname="ATSAMV71J20">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="samv71/include/sam.h" define="__SAMV71J20__"/>
            <debug svd="samv71/svd/ATSAMV71J20.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00100000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="samv71/keil/flash/ATSAMV7x_1024.FLM" start="0x00400000" size="0x00100000" default="1"/>
            <algorithm name="samv71/keil/flash/ATSAMV7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samv71/atdf/ATSAMV71J20.atdf"/>
                  <at:variant ordercode="ATSAMV71J20A-AAB" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samv71/edc/ATSAMV71J20.PIC"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM&#174; Cortex&#174;-M7 microcontroller with 1MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, CAN-FD, Full-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins ARM&#174; Cortex&#174;-M7 microcontroller with 1MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, CAN-FD, Full-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMV71J20" title="Device page for ATSAMV71J20"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMV71J20" title="Datasheet"/>
         </device>
         <device Dname="ATSAMV71Q20">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="samv71/include/sam.h" define="__SAMV71Q20__"/>
            <debug svd="samv71/svd/ATSAMV71Q20.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00100000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="samv71/keil/flash/ATSAMV7x_512.FLM" start="0x00400000" size="0x00080000" default="1"/>
            <algorithm name="samv71/keil/flash/ATSAMV7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samv71/atdf/ATSAMV71Q20.atdf"/>
                  <at:variant ordercode="ATSAMV71Q20A-CB" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAMV71Q20A-AAB" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS0" start="0x60000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS1" start="0x61000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS2" start="0x62000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS3" start="0x63000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samv71/edc/ATSAMV71Q20.PIC"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM&#174; Cortex&#174;-M7 microcontroller with 1MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, dual CAN-FD, SD/MMC, High-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 3 USARTs/SPI, 2 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, External Bus Interface, SDRAM Controller, 144 pins ARM&#174; Cortex&#174;-M7 microcontroller with 1MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, dual CAN-FD, SD/MMC, High-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 3 USARTs/SPI, 2 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, External Bus Interface, SDRAM Controller, 144 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMV71Q20" title="Device page for ATSAMV71Q20"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMV71Q20" title="Datasheet"/>
         </device>
