Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/Microchip.SAMV71_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71J19">
         <description>Headers and startup code for Microchip ATSAMV71J19</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71j19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71j19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71j19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71j19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/armcc/startup_samv71j19.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/system_samv71j19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71j19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71j19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71j19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71j19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71N19">
         <description>Headers and startup code for Microchip ATSAMV71N19</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71n19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71n19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71n19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71n19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/armcc/startup_samv71n19.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/system_samv71n19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71n19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71n19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71n19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71n19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71Q21">
         <description>Headers and startup code for Microchip ATSAMV71Q21</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71q21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71q21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71q21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71q21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/armcc/startup_samv71q21.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/system_samv71q21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71q21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71q21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71q21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71q21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71N21">
         <description>Headers and startup code for Microchip ATSAMV71N21</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71n21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71n21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71n21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71n21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/armcc/startup_samv71n21.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/system_samv71n21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71n21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71n21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71n21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71n21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71N20">
         <description>Headers and startup code for Microchip ATSAMV71N20</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71n20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71n20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71n20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71n20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/armcc/startup_samv71n20.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/system_samv71n20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71n20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71n20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71n20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71n20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71J21B">
         <description>Headers and startup code for Microchip ATSAMV71J21B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71j21b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71j21b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71j21b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71j21b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/armcc/startup_samv71j21b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/system_samv71j21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71j21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71j21b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71j21b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71j21b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71J20B">
         <description>Headers and startup code for Microchip ATSAMV71J20B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71j20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71j20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71j20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71j20b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/armcc/startup_samv71j20b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/system_samv71j20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71j20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71j20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71j20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71j20b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71Q20B">
         <description>Headers and startup code for Microchip ATSAMV71Q20B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71q20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71q20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71q20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71q20b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/armcc/startup_samv71q20b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/system_samv71q20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71q20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71q20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71q20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71q20b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71Q19">
         <description>Headers and startup code for Microchip ATSAMV71Q19</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71q19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71q19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71q19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71q19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/armcc/startup_samv71q19.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/system_samv71q19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71q19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71q19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71q19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71q19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71N19B">
         <description>Headers and startup code for Microchip ATSAMV71N19B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71n19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71n19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71n19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71n19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/armcc/startup_samv71n19b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/system_samv71n19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71n19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71n19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71n19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71n19b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="ATSAMV71Q19B">
         <description>Headers and startup code for Microchip ATSAMV71Q19B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71q19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71q19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71q19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71q19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/armcc/startup_samv71q19b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/system_samv71q19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71q19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71q19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71q19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71q19b/flash.icf" attr="config"/>
         </files>
      </component>
